src/Enums/SSL_IT_ВариантыВыполненияЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_ВариантыВыполненияЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьПакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьПакетСПромежуточнымиДанными</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SSL_IT_РезультатыВыполненияЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_РезультатыВыполненияЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/SSL_IT_Запросы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция формирует запрос, сразу устанавливая ему текст и менеджер временных таблиц, если они заданы.
//
// Параметры:
//	ТекстЗапроса			- Строка					- Текст, который будет установлен в качестве текста запроса, если задан.
//	МенеджерВременныхТаблиц	- МенеджерВременныхТаблиц	- Менеджер временных таблиц, который будет присвоен запросу, если задан.
//	ПараметрыЗапроса		- Структура					- Параметры, передаваемые в запрос.
//
// Возвращаемое значение:
//	Запрос - Запрос с заданными параметрами.	
//	
Функция ПолучитьЗапрос(Знач ТекстЗапроса = "", МенеджерВременныхТаблиц = Неопределено, ПараметрыЗапроса = Неопределено) Экспорт 
	
	Запрос = Новый Запрос();
	ТекстЗапроса = SSL_IT_ОбработкаДанных.ОпределитьЗначение(ТекстЗапроса, Тип("Строка"), "");
	МенеджерВременныхТаблиц	= SSL_IT_ОбработкаДанных.ОпределитьЗначение(МенеджерВременныхТаблиц, Тип("МенеджерВременныхТаблиц"), Неопределено);
	
	Если Не(ПустаяСтрока(ТекстЗапроса)) Тогда 
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда 
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Если ПараметрыЗапроса <> Неопределено Тогда 
		ТипПараметров = ТипЗнч(ПараметрыЗапроса);
		
		Если ТипПараметров = Тип("Структура") Тогда 
			Для Каждого КлючИЗначение Из ПараметрыЗапроса Цикл 
				Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
	
	// Возврат
	Возврат Запрос;
	
КонецФункции	

// Функиця формирует и выполняет запрос.
//
// Параметры:
//	ТекстЗапроса			- Строка												- Текст запроса.
//	МенеджерВременныхТаблиц	- МенеджерВременныхТаблиц								- Применяется при необходимости
//	ПараметрыЗапроса		- Структура												- Структура параметров где ключ и занчение являются имененм и значением параметра запроса.
//	ВариантВыполнения		- ПеречислениеСсылка.SSL_IT_ВариантыВыполненияЗапроса	- Значение по умолчанию: Выполнить. Может принимать значения: Выполнить, ВыполнитьПакет, ВыполнитьПакетСПромежуточнымиДанными. 
//	РезультатВыполнения		- ПеречислениеСсылка.SSL_IT_РезультатыВыполненияЗапроса	- Значение по умолчанию: Неопределено. Может принимать значения: Неопределено, Выборка, Выгрузка.
//	НомерПакета				- Число													- Используется, когда результат выполнения отличен от "Неопределено", а вариант выполнения пакетный.
//
Функция СформироватьВыполнитьЗапрос(
		Знач ТекстЗапроса			= "", 
		МенеджерВременныхТаблиц		= Неопределено, 
		ПараметрыЗапроса			= Неопределено, 
		Знач ВариантВыполнения		= Неопределено, 
		Знач РезультатВыполнения	= Неопределено,
		НомерПакета					= 0) Экспорт
	
	Запрос = ПолучитьЗапрос(ТекстЗапроса, МенеджерВременныхТаблиц, ПараметрыЗапроса);
	
	// Определение параметров выполнения и построения результата
	ВариантВыполнения = SSL_IT_ОбработкаДанных.ОпределитьЗначение(
		ВариантВыполнения,
		Тип("ПеречислениеСсылка.SSL_IT_ВариантыВыполненияЗапроса"), 
		Перечисления.SSL_IT_ВариантыВыполненияЗапроса.Выполнить);
	РезультатВыполнения = SSL_IT_ОбработкаДанных.ОпределитьЗначение(
		РезультатВыполнения, 
		Тип("ПеречислениеСсылка.SSL_IT_РезультатыВыполненияЗапроса"), 
		Неопределено);
	НомерПакета = SSL_IT_ОбработкаДанных.ОпределитьЗначение(НомерПакета, Тип("Число"), 0);
	
	// Выполнение запроса
	Если ВариантВыполнения = Перечисления.SSL_IT_ВариантыВыполненияЗапроса.Выполнить Тогда 
		РезультатЗапроса = Запрос.Выполнить();
	ИначеЕсли ВариантВыполнения = Перечисления.SSL_IT_ВариантыВыполненияЗапроса.ВыполнитьПакет Тогда 
		РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ИначеЕсли ВариантВыполнения = Перечисления.SSL_IT_ВариантыВыполненияЗапроса.ВыполнитьПакетСПромежуточнымиДанными Тогда	
		РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();	
	КонецЕсли;	
	
	// Построение результата при необходимости
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат РезультатЗапроса;
	Иначе	
		// Определение типа результата
		ТипРезультата = ТипЗнч(РезультатЗапроса);
		
		Если ТипРезультата = Тип("РезультатЗапроса") Тогда 	
			ЭкземплярРезультата = РезультатЗапроса;
		ИначеЕсли ТипРезультата = Тип("Массив") Тогда 	
			ЭкземплярРезультата = РезультатЗапроса.Получить(НомерПакета);			
		КонецЕсли;	
			
		// Формирование результата
		Если РезультатВыполнения = Перечисления.SSL_IT_РезультатыВыполненияЗапроса.Выборка Тогда 	
			Возврат ЭкземплярРезультата.Выбрать();
		ИначеЕсли РезультатВыполнения = Перечисления.SSL_IT_РезультатыВыполненияЗапроса.Выгрузка Тогда 
			Возврат ЭкземплярРезультата.Выгрузить();
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции	

#КонецОбласти
